Table of Contents
 Class Identifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class Identifier<T> : IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Derived
ImmutableIdentifier<T>
Inherited Members
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Properties
 ObjectType
public Type ObjectType { get; }
Property Value
Type
Methods
 Equals(IIdentifier)
Indicates whether the current object is equal to another object of the same type.
public virtual bool Equals(IIdentifier other)
Parameters
other IIdentifier
An object to compare with this object.
Returns
bool
true if the current object is equal to the other parameter; otherwise, false.
 Equals(object)
Determines whether the specified object is equal to the current object.
public override bool Equals(object obj)
Parameters
obj object
The object to compare with the current object.
Returns
bool
true if the specified object is equal to the current object; otherwise, false.
 GetHashCode()
Serves as the default hash function.
public override int GetHashCode()
Returns
int
A hash code for the current object.
 GetId()
public abstract object GetId()
Returns
object
 GetStringId()
public abstract string GetStringId()
Returns
string
 Edit this page